config/templates/xml/PRPA_IN201305UV02.xml

{{define "PRPA_IN201305UV02"}}
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <S:Header xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:stctx="com.spirit.transaction.ctx">
    <wsse:Security S:mustUnderstand="true" xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:stctx="com.spirit.transaction.ctx" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      {{.SAML}}
    </wsse:Security>
    <To xmlns="http://www.w3.org/2005/08/addressing" xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:stctx="com.spirit.transaction.ctx">{{.IHEPIXSrvc.Scheme}}://{{.IHEPIXSrvc.Host}}:{{.IHEPIXSrvc.Port}}/{{.IHEPIXSrvc.Url}}</To>
    <Action S:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing" xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:stctx="com.spirit.transaction.ctx">urn:hl7-org:v3:PRPA_IN201305UV02</Action>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:stctx="com.spirit.transaction.ctx">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
    <FaultTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:stctx="com.spirit.transaction.ctx">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </FaultTo>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing" xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:stctx="com.spirit.transaction.ctx">uuid:{{.ContextID}}</MessageID>
    <stctx:context xmlns="http://docs.oasis-open.org/ws-caf/2005/10/wsctx" xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:stctx="com.spirit.transaction.ctx">
      <context-identifier>urn:uuid:{{.ContextID}}</context-identifier>
    </stctx:context>
  </S:Header>
  <S:Body xmlns:S="http://www.w3.org/2003/05/soap-envelope">
    <PRPA_IN201305UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3">
      <id extension="{{.ContextID}}" root="2.76.43.7.43.23"/>
      <creationTime value="{{newdatetime}}"/>
      <versionCode code="V3PR1"/>
      <interactionId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="P"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id displayable="false" extension="1" root="1.2.40.0.34.99.10.1.10.2.1"/>
          <asAgent classCode="AGNT">
            <representedOrganization classCode="ORG" determinerCode="INSTANCE">
              <id displayable="false" extension="1" root="1.2.40.0.34.99.10.1.10.2"/>
            </representedOrganization>
          </asAgent>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id displayable="false" extension="1" root="1.2.40.0.34.99.10.1.10.1.1"/>
          <asAgent classCode="AGNT">
            <representedOrganization classCode="ORG" determinerCode="INSTANCE">
              <id displayable="false" extension="1" root="1.2.40.0.34.99.10.1.10.1"/>
            </representedOrganization>
          </asAgent>
        </device>
      </sender>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201305UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <authorOrPerformer typeCode="AUT">
          <assignedPerson classCode="ASSIGNED">
            <id displayable="false" extension="1" root="1.2.40.0.34.99.10.1.10.1.2"/>
          </assignedPerson>
        </authorOrPerformer>
        <queryByParameter>
          <queryId extension="1639746943061" root="1.3.6.1.4.1.21998.2.1.10.15"/>
          <statusCode code="new"/>
          <responseModalityCode code="R"/>
          <responsePriorityCode code="I"/>
          <matchCriterionList>
            <matchAlgorithm>
              <value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ST">QARD</value>
              <semanticsText>MatchAlgorithm</semanticsText>
            </matchAlgorithm>
          </matchCriterionList>
          <parameterList>
            <livingSubjectId>
              <value extension="{{.PID}}" root="{{.PIDOid}}"/>
              <semanticsText>LivingSubject.id</semanticsText>
            </livingSubjectId>
            <patientStatusCode>
              <value code="active" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="CS"/>
              <semanticsText>Patient.statusCode</semanticsText>
            </patientStatusCode>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </PRPA_IN201305UV02>
  </S:Body>
</env:Envelope>
{{end}}